pages/research/projects/nembes.org
#+CSL-STYLE: ../../../files/complete-online.csl

* Nembes

  NEMBES -- Networks embedded systems in the built environment -- was a
  project funded in Ireland to explore how to improve building
  performance and building.  It involved researchers from Trinity
  College, UCD, Cork IT, the Tyndall Institute, and others institutions.

  The consortium was an interesting mix of hardware engineers and
  software researchers, with very different ideas about what constituted
  "systems": indeed, one of the best parts of the project was in working
  out exactly what we all meant and how our ideas fitted together!

  Our part of the work mainly focused on sensor networks and their
  applications. We looked at robustness to errors, since that's a major
  issue for built structures. We also explored localisation using
  ultrasonic signals, which again are a great way to deal with
  in-building localisation built-into the infrastructure.

  With my colleague Kieran Delaney I also did some preparatory work on
  building materials "augmented" with computational elements. This idea
  built on the work on [amorphous
  computing](https://en.wikipedia.org/wiki/Amorphous_computing), but with
  computing elements included into physical materials. This opens-up a
  lot of opportunities, since the computing and the material become
  essentially inseparable; it's also challenging to consider how one
  would bind electronics to a physical material in a way that will
  survive some of the processes materials go through. (It was a surprise
  to learn exactly how hot concrete gets as it cures.) It's a topic that
  I'd like to go back to in terms of the approrpiate programming
  paradigms.


** Publications

   #+begin: sd/bibliography :key keywords :value NEMBES
   <<citeproc_bib_item_1>>Abu Raihan M. Kamal, Chris Bleakley, and Simon Dobson. /[[https://dx.doi.org//10.1145/2530526][Failure Detection in Wireless Sensor Networks: A Sequence Based Dynamic Approach]]/. ACM Transactions on Sensor Networks *10*. 2014.

   <<citeproc_bib_item_2>>Abu Raihan M. Kamal, Chris Bleakley, and Simon Dobson. /[[https://dx.doi.org//10.1145/2422966.2422976][Packet-Level Attestation (PLA): a Framework for in-Network Sensor-Data Reliability]]/. ACM Transactions on Sensor Networks *9*. 2013.

   <<citeproc_bib_item_3>>Mohamed Saad, Chris Bleakley, Tarig Ballal, and Simon Dobson. /[[https://dx.doi.org//10.1109/TIM.2011.2181911][High-Accuracy Reference-Free Ultrasonic Location Estimation]]/. IEEE Transactions on Instrumentation and Measurement *61*, pp.1561–1570. 2012.

   <<citeproc_bib_item_4>>Abu Raihan M. Kamal, Chris Bleakley, and Simon Dobson. /[[https://dx.doi.org//10.1145/2387027.2387043][Congestion Mitigation Using in-Network Sensor Data Summarization]]/. In /Proceedings of the Ninth ACM International Symposium on Performance Evaluation of Wireless Ad Hoc, Sensor, and Ubiquitous Networks/, pp.93–100. Paphos, CY. 2012.

   <<citeproc_bib_item_5>>Mohamed Saad, Chris Bleakley, and Simon Dobson. /[[https://dx.doi.org//10.1109/TIM.2011.2128950][Robust High Accuracy Ultrasonic Range Measurement System]]/. IEEE Transactions on Instrumentation and Measurement *60*, pp.3334–3341. 2011.

   <<citeproc_bib_item_6>>M.A. Razzaque and Simon Dobson. /[[https://simondobson.org/softcopy/adhoc-09.pdf][Enhancement of Self-Organisation in Wireless Networking through a Cross-Layer Approach]]/. In /Proceedings of the 1st International Conference on Ad Hoc Networks/. Niagara Falls, ca. 2009.

   <<citeproc_bib_item_7>>Eleanor O’Neill, Kris McGlinn, Eoin Bailey, Simon Dobson, and Kevin McCarthy. /[[https://simondobson.org/softcopy/iwcams-09.pdf][Application Development Using Modelling and Dynamical Systems Analysis]]/. In /Proceedings of the 1st International Workshop on Context-Aware Middleware and Services/, pp.18–23. Dublin, IE. 2009.

   <<citeproc_bib_item_8>>M.A. Razzaque, Simon Dobson, and Paddy Nixon. /[[https://simondobson.org/softcopy/clsr-08.pdf][Cross-Layer Self Routing: A Self-Managed Routing Approach for MANETs]]/. In /Proceedings of the 4th IEEE International Conference on Wireless and Mobile Computing, Networking and Communications/. IEEE Press. Avignon, FR. 2008.

   <<citeproc_bib_item_9>>Kieran Delaney and Simon Dobson. /Augmenting Materials to Build Cooperating Objects/. In /Ambient Intelligence with Microsystems: Augmented Materials and Smart Objects/, pp.19–46. Kieran Delaney, editor. Vol.18. Springer Verlag. ISBN 978-0-387-46293-9. 2008.

   <<citeproc_bib_item_10>>Simon Dobson. /Co-Design for Context Awareness in Pervasive Systems/. In /Ambient Intelligence with Microsystems: Augmented Materials and Smart Objects/, pp.297–307. Kieran Delaney, editor. Vol.18. Springer Verlag. ISBN 978-0-387-46293-9. 2008.
   #+end:
