research/projects/nembes/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>The NEMBES project | Simon Dobson</title>
<link rel="icon" href="../../../images/favicon.png" sizes="16x16">
<link rel="alternate" type="application/rss+xml" href="../../../rss.xml">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Droid+Sans+Mono|Libre+Baskerville|Montserrat|Playfair+Display|Tangerine">
<link rel="stylesheet" href="../../../assets/css/libretto_styles.css">
<link rel="stylesheet" href="../../../assets/css/baguetteBox.min.css">
<link rel="stylesheet" href="../../../assets/css/code.css">
<link rel="stylesheet" href="../../../assets/css/nikola_rst.css">
<link rel="stylesheet" href="../../../assets/css/nikola_ipython.css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
</head>
<body>
    <!-- Navigation bar -->
    <header class="nav-bar"><div class="site-branding">
	    <h1 class="site-title">
		<a href="https://simondobson.org/" title="Simon Dobson" rel="home">Simon&nbsp;Dobson</a>
	    </h1>
	</div>
	<nav class="site-navigation" role="navigation"><div class="menu-toggle">
		<span class="mobile-site-title">Simon Dobson</span>
	    </div>
	    <ul class="menu">
<li><a href="../../../index.html">Home</a></li>
		    <li><a href="../../../personal/">About&nbsp;me</a></li>
		    <li><a href="../../">Research</a></li>
		    <li><a href="../../../development/projects/">Software</a></li>
		    <li><a href="../../../writing/">Writing</a></li>
		    <li><a href="../../../personal/contact/">Contact</a></li>
		<li>
<a href="../../../rss.xml"><i class="fa fa-rss"></i></a>
	    </li>
</ul></nav></header><!-- Page Header --><div class="title-block post-format-icon-pin">
	<h1>The <span class="caps">NEMBES</span>&nbsp;project</h1>
    </div>

	<!-- Page Content -->
    <div class="site-content" role="main">
	<article class="format-standard libretto-long-form"><div class="entry-content">
		<div id="outline-container-orge474ed1" class="outline-2">
<h2 id="orge474ed1">Nembes</h2>
<div class="outline-text-2" id="text-orge474ed1">
<p>
<span class="caps">NEMBES</span> – Networks embedded systems in the built environment – was a
project funded in Ireland to explore how to improve building
performance and building.  It involved researchers from Trinity
College, <span class="caps">UCD</span>, Cork <span class="caps">IT</span>, the Tyndall Institute, and others&nbsp;institutions.
</p>

<p>
The consortium was an interesting mix of hardware engineers and
software researchers, with very different ideas about what constituted
&#8220;systems&#8221;: indeed, one of the best parts of the project was in working
out exactly what we all meant and how our ideas fitted&nbsp;together!
</p>

<p>
Our part of the work mainly focused on sensor networks and their
applications. We looked at robustness to errors, since that&#8217;s a major
issue for built structures. We also explored localisation using
ultrasonic signals, which again are a great way to deal with
in-building localisation built-into the&nbsp;infrastructure.
</p>

<p>
With my colleague Kieran Delaney I also did some preparatory work on
building materials &#8220;augmented&#8221; with computational elements. This idea
built on the work on [amorphous
computing](<a href="https://en.wikipedia.org/wiki/Amorphous_computing">https://en.wikipedia.org/wiki/Amorphous_computing</a>), but with
computing elements included into physical materials. This opens-up a
lot of opportunities, since the computing and the material become
essentially inseparable; it&#8217;s also challenging to consider how one
would bind electronics to a physical material in a way that will
survive some of the processes materials go through. (It was a surprise
to learn exactly how hot concrete gets as it cures.) It&#8217;s a topic that
I&#8217;d like to go back to in terms of the approrpiate programming&nbsp;paradigms.
</p>
</div>


<div id="outline-container-orgcc8133c" class="outline-3">
<h3 id="orgcc8133c">Publications</h3>
<div class="outline-text-3" id="text-orgcc8133c">
<p>
<a id="orgddb73f7"></a>Abu Raihan M. Kamal, Chris Bleakley, and Simon Dobson. <i><a href="https://dx.doi.org//10.1145/2530526">Failure Detection in Wireless Sensor Networks: A Sequence Based Dynamic Approach</a></i>. <span class="caps">ACM</span> Transactions on Sensor Networks <b>10</b>.&nbsp;2014.
</p>

<p>
<a id="org61bd4fe"></a>Abu Raihan M. Kamal, Chris Bleakley, and Simon Dobson. <i><a href="https://dx.doi.org//10.1145/2422966.2422976">Packet-Level Attestation (<span class="caps">PLA</span>): a Framework for in-Network Sensor-Data Reliability</a></i>. <span class="caps">ACM</span> Transactions on Sensor Networks <b>9</b>.&nbsp;2013.
</p>

<p>
<a id="orgaf61582"></a>Mohamed Saad, Chris Bleakley, Tarig Ballal, and Simon Dobson. <i><a href="https://dx.doi.org//10.1109/TIM.2011.2181911">High-Accuracy Reference-Free Ultrasonic Location Estimation</a></i>. <span class="caps">IEEE</span> Transactions on Instrumentation and Measurement <b>61</b>, pp.1561–1570.&nbsp;2012.
</p>

<p>
<a id="org4b2b994"></a>Abu Raihan M. Kamal, Chris Bleakley, and Simon Dobson. <i><a href="https://dx.doi.org//10.1145/2387027.2387043">Congestion Mitigation Using in-Network Sensor Data Summarization</a></i>. In <i>Proceedings of the Ninth <span class="caps">ACM</span> International Symposium on Performance Evaluation of Wireless Ad Hoc, Sensor, and Ubiquitous Networks</i>, pp.93–100. Paphos, <span class="caps">CY</span>.&nbsp;2012.
</p>

<p>
<a id="org4dfa7cb"></a>Mohamed Saad, Chris Bleakley, and Simon Dobson. <i><a href="https://dx.doi.org//10.1109/TIM.2011.2128950">Robust High Accuracy Ultrasonic Range Measurement System</a></i>. <span class="caps">IEEE</span> Transactions on Instrumentation and Measurement <b>60</b>, pp.3334–3341.&nbsp;2011.
</p>

<p>
<a id="org924ae01"></a><span class="caps">M.A.</span> Razzaque and Simon Dobson. <i><a href="https://simondobson.org/softcopy/adhoc-09.pdf">Enhancement of Self-Organisation in Wireless Networking through a Cross-Layer Approach</a></i>. In <i>Proceedings of the 1st International Conference on Ad Hoc Networks</i>. Niagara Falls, ca.&nbsp;2009.
</p>

<p>
<a id="org1130aa4"></a>Eleanor O’Neill, Kris McGlinn, Eoin Bailey, Simon Dobson, and Kevin McCarthy. <i><a href="https://simondobson.org/softcopy/iwcams-09.pdf">Application Development Using Modelling and Dynamical Systems Analysis</a></i>. In <i>Proceedings of the 1st International Workshop on Context-Aware Middleware and Services</i>, pp.18–23. Dublin, <span class="caps">IE</span>.&nbsp;2009.
</p>

<p>
<a id="org2c6f270"></a><span class="caps">M.A.</span> Razzaque, Simon Dobson, and Paddy Nixon. <i><a href="https://simondobson.org/softcopy/clsr-08.pdf">Cross-Layer Self Routing: A Self-Managed Routing Approach for MANETs</a></i>. In <i>Proceedings of the 4th <span class="caps">IEEE</span> International Conference on Wireless and Mobile Computing, Networking and Communications</i>. <span class="caps">IEEE</span> Press. Avignon, <span class="caps">FR</span>.&nbsp;2008.
</p>

<p>
<a id="org9f498b9"></a>Kieran Delaney and Simon Dobson. <i>Augmenting Materials to Build Cooperating Objects</i>. In <i>Ambient Intelligence with Microsystems: Augmented Materials and Smart Objects</i>, pp.19–46. Kieran Delaney, editor. Vol.18. Springer Verlag. <span class="caps">ISBN</span> 978-0-387-46293-9.&nbsp;2008.
</p>

<p>
<a id="orge914b7d"></a>Simon Dobson. <i>Co-Design for Context Awareness in Pervasive Systems</i>. In <i>Ambient Intelligence with Microsystems: Augmented Materials and Smart Objects</i>, pp.297–307. Kieran Delaney, editor. Vol.18. Springer Verlag. <span class="caps">ISBN</span> 978-0-387-46293-9.&nbsp;2008.
</p>
</div>
</div>
</div>
	    </div>
	</article>
</div>

	<!-- Social sharing section -->

	<!-- Tag Section -->

	<!-- Post Navigation links -->

    <!-- Page Footer -->
    <section class="footer-sidebar clear" role="complementary"><div class="widget-block">
	    <aside class="widget"><h2 class="widget-title">Simon&nbsp;Dobson</h2>
		<div class="widget-text">Aut tace aut loquere meliora silentio</div>
	    </aside>
</div>
    </section><!-- Extra JavaScript --><!-- Site Attributions --><footer class="site-footer" role="contentinfo"><div class="site-info">
	    <p></p>
	    <p>
	      Built with free and open-source software.
	      Powered by <a href="https://getnikola.com/">Nikola</a> using a theme based on
	      <a href="https://themes.getnikola.com/v7/libretto/">Libretto</a>.
	    </p>
	    <p>
	      All content Copyright © 2010–2024 Simon Dobson and licensed under
	      <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/"><span class="caps">CC</span>-<span class="caps">BY</span>-<span class="caps">NC</span>-<span class="caps">SA</span>-4.0</a>
	      unless otherwise&nbsp;noted.
	    </p>
	</div>
	<div class="social">
	    <ul class="menu"></ul>
</div>
    </footer>
</body>
</html>